server/tests/performance.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5

scenarios:
  - name: "Protected endpoints without login"
    flow:
      - get:
          url: "/api/event"
      - get:
          url: "/api/events/1/forum/posts"
      - get:
          url: "/api/events/1/forum/posts/1/comments"